###  Lab Exercise #5 Code

In [20]:
# Importing necessary library
import pandas as pd
import numpy as np
from dateutil.parser import parse
from datetime import datetime

In [21]:
# Loading and Reading CSV file 
transactions = pd.read_csv('inconsistent_transactions.csv') 
transactions

     transaction_id product_id  quantity   price   timestamp
0             T0000       P007       5.0     NaN  2024-10-06
1             T0001       P015       8.0     NaN  2024-11-04
2             T0002       P011       5.0   47.56  10/13/2024
3             T0003     P 008        8.0    37.6  10/28/2024
4             T0004       p007       7.0   40.84  28-10-2024
...             ...        ...       ...     ...         ...
9995          T9995       p015       2.0  $25.31  2024-10-21
9996          T9996       p016       NaN   15.65  10/11/2024
9997          T9997      P-010       6.0   40.55  22-10-2024
9998          T9998       P006       4.0   26.33  2024-11-01
9999          T9999     P 017        4.0  $28.06  10/29/2024

[10000 rows x 5 columns]

### Creating a copy of the original transactions data

In [22]:

modified_data = transactions.copy()
modified_data

     transaction_id product_id  quantity   price   timestamp
0             T0000       P007       5.0     NaN  2024-10-06
1             T0001       P015       8.0     NaN  2024-11-04
2             T0002       P011       5.0   47.56  10/13/2024
3             T0003     P 008        8.0    37.6  10/28/2024
4             T0004       p007       7.0   40.84  28-10-2024
...             ...        ...       ...     ...         ...
9995          T9995       p015       2.0  $25.31  2024-10-21
9996          T9996       p016       NaN   15.65  10/11/2024
9997          T9997      P-010       6.0   40.55  22-10-2024
9998          T9998       P006       4.0   26.33  2024-11-01
9999          T9999     P 017        4.0  $28.06  10/29/2024

[10000 rows x 5 columns]

### Extending the range of transaction IDS

In [23]:
modified_data['transaction_id'] = modified_data['transaction_id'].str.replace(r'^T','T0', regex=True)
modified_data

     transaction_id product_id  quantity   price   timestamp
0            T00000       P007       5.0     NaN  2024-10-06
1            T00001       P015       8.0     NaN  2024-11-04
2            T00002       P011       5.0   47.56  10/13/2024
3            T00003     P 008        8.0    37.6  10/28/2024
4            T00004       p007       7.0   40.84  28-10-2024
...             ...        ...       ...     ...         ...
9995         T09995       p015       2.0  $25.31  2024-10-21
9996         T09996       p016       NaN   15.65  10/11/2024
9997         T09997      P-010       6.0   40.55  22-10-2024
9998         T09998       P006       4.0   26.33  2024-11-01
9999         T09999     P 017        4.0  $28.06  10/29/2024

[10000 rows x 5 columns]

### Enforcing a single Product ID format

In [24]:
pd.reset_option('display.max_rows', None)
modified_data['product_id'] = modified_data['product_id'].str.replace(' ','').str.replace('-','').str.replace('p','P')
modified_data

     transaction_id product_id  quantity   price   timestamp
0            T00000       P007       5.0     NaN  2024-10-06
1            T00001       P015       8.0     NaN  2024-11-04
2            T00002       P011       5.0   47.56  10/13/2024
3            T00003       P008       8.0    37.6  10/28/2024
4            T00004       P007       7.0   40.84  28-10-2024
...             ...        ...       ...     ...         ...
9995         T09995       P015       2.0  $25.31  2024-10-21
9996         T09996       P016       NaN   15.65  10/11/2024
9997         T09997       P010       6.0   40.55  22-10-2024
9998         T09998       P006       4.0   26.33  2024-11-01
9999         T09999       P017       4.0  $28.06  10/29/2024

[10000 rows x 5 columns]

### Changing the price format

In [25]:
modified_data['price'] = modified_data['price'].str.replace('$','')
modified_data['price'] = modified_data['price'].astype(float).round(2)
modified_data

     transaction_id product_id  quantity  price   timestamp
0            T00000       P007       5.0    NaN  2024-10-06
1            T00001       P015       8.0    NaN  2024-11-04
2            T00002       P011       5.0  47.56  10/13/2024
3            T00003       P008       8.0  37.60  10/28/2024
4            T00004       P007       7.0  40.84  28-10-2024
...             ...        ...       ...    ...         ...
9995         T09995       P015       2.0  25.31  2024-10-21
9996         T09996       P016       NaN  15.65  10/11/2024
9997         T09997       P010       6.0  40.55  22-10-2024
9998         T09998       P006       4.0  26.33  2024-11-01
9999         T09999       P017       4.0  28.06  10/29/2024

[10000 rows x 5 columns]

### Formatting the timestamp

In [26]:
def new_timestamp(row):
    try:
        if '-' in row and row.count('-') == 2:
            try:
                ts = datetime.strptime(row, '%d-%m-%Y')
                return ts.strftime('%Y-%m-%d') 
            except ValueError:
                pass  
        
        ts = parse(row)
        return ts.strftime('%Y-%m-%d')
    
    except ValueError:
        return row  

modified_data['timestamp'] = modified_data['timestamp'].apply(new_timestamp)
modified_data

     transaction_id product_id  quantity  price   timestamp
0            T00000       P007       5.0    NaN  2024-10-06
1            T00001       P015       8.0    NaN  2024-11-04
2            T00002       P011       5.0  47.56  2024-10-13
3            T00003       P008       8.0  37.60  2024-10-28
4            T00004       P007       7.0  40.84  2024-10-28
...             ...        ...       ...    ...         ...
9995         T09995       P015       2.0  25.31  2024-10-21
9996         T09996       P016       NaN  15.65  2024-10-11
9997         T09997       P010       6.0  40.55  2024-10-22
9998         T09998       P006       4.0  26.33  2024-11-01
9999         T09999       P017       4.0  28.06  2024-10-29

[10000 rows x 5 columns]

### Reformatting the TransactionIDs in chronological order

In [27]:
modified_data = modified_data.sort_values(by='timestamp')
modified_data['transaction_id'] = ['T{:05d}'.format(i) for i in range(len(modified_data))]
modified_data

     transaction_id product_id  quantity  price   timestamp
0            T00000       P007       5.0    NaN  2024-10-06
1870         T00001       P017       6.0  42.35  2024-10-06
6668         T00002       P007       5.0  47.48  2024-10-06
6631         T00003       P015       1.0  31.32  2024-10-06
1921         T00004       P010       7.0  49.36  2024-10-06
...             ...        ...       ...    ...         ...
3267         T09995       P008       5.0  45.74  2024-11-04
7509         T09996       P012       2.0  21.12  2024-11-04
2301         T09997       P007       7.0  38.48  2024-11-04
6236         T09998       P019       2.0  24.84  2024-11-04
4602         T09999       P014       NaN  24.92  2024-11-04

[10000 rows x 5 columns]

### Computing the unit prices

In [28]:
## Create a dataframe for rows with complete column values
complete_transactions = modified_data.dropna()
unique_products = complete_transactions.copy()

In [29]:
## Computation for unit price
unique_products['unit_price'] = (unique_products['price'] / unique_products['quantity'])

In [30]:
unique_products['max_unit_price'] = unique_products.groupby('product_id')['unit_price'].transform('max')
unique_products = unique_products.drop_duplicates(subset='product_id')
unique_products = unique_products.drop(columns=['transaction_id','quantity','price','timestamp','unit_price'])
unique_products

     product_id  max_unit_price
1870       P017           49.31
6668       P007           48.56
6631       P015           48.28
1921       P010           49.88
1937       P006           49.67
6557       P001           49.41
6550       P013           49.99
1951       P002           47.51
9378       P019           49.62
9340       P011           47.17
6521       P003           49.39
6487       P016           49.80
9405       P009           49.47
2009       P004           49.35
1980       P014           47.59
1865       P018           49.10
6871       P005           47.94
6863       P008           49.92
6353       P012           48.33

### Removing rows with null values for both quantity and price

In [31]:
modified_data = modified_data.dropna(subset=['quantity','price'], how='all')

### Computing for the missing unit prices and quantities

In [32]:

modified_data = modified_data.merge(unique_products, on='product_id', how='left')

In [33]:
modified_data['price'] = modified_data['price'].fillna((modified_data['max_unit_price'] * modified_data['quantity']).round(2))
modified_data['quantity'] = modified_data['quantity'].fillna((modified_data['price'] / modified_data['max_unit_price']).apply(np.floor))
modified_data['quantity'] = modified_data['quantity'].replace(0, 1)
modified_data

     transaction_id product_id  quantity   price   timestamp  max_unit_price
0            T00000       P007       5.0  242.80  2024-10-06           48.56
1            T00001       P017       6.0   42.35  2024-10-06           49.31
2            T00002       P007       5.0   47.48  2024-10-06           48.56
3            T00003       P015       1.0   31.32  2024-10-06           48.28
4            T00004       P010       7.0   49.36  2024-10-06           49.88
...             ...        ...       ...     ...         ...             ...
9899         T09995       P008       5.0   45.74  2024-11-04           49.92
9900         T09996       P012       2.0   21.12  2024-11-04           48.33
9901         T09997       P007       7.0   38.48  2024-11-04           48.56
9902         T09998       P019       2.0   24.84  2024-11-04           49.62
9903         T09999       P014       1.0   24.92  2024-11-04           47.59

[9904 rows x 6 columns]

In [34]:
# Drop max_unit_price to maintain original data format
modified_data = modified_data.drop(columns=['max_unit_price'])

In [35]:
# Change quantity to int
modified_data['quantity'] = modified_data['quantity'].astype(int)
modified_data

     transaction_id product_id  quantity   price   timestamp
0            T00000       P007         5  242.80  2024-10-06
1            T00001       P017         6   42.35  2024-10-06
2            T00002       P007         5   47.48  2024-10-06
3            T00003       P015         1   31.32  2024-10-06
4            T00004       P010         7   49.36  2024-10-06
...             ...        ...       ...     ...         ...
9899         T09995       P008         5   45.74  2024-11-04
9900         T09996       P012         2   21.12  2024-11-04
9901         T09997       P007         7   38.48  2024-11-04
9902         T09998       P019         2   24.84  2024-11-04
9903         T09999       P014         1   24.92  2024-11-04

[9904 rows x 5 columns]

In [36]:
print(len(modified_data))

9904